const provincesSelect = document.querySelector(".provinces-select");
const citiesSelect = document.querySelector(".cities-select");

const cities = {
  آذربایجان_شرقی: [
    "تبریز",
    "جلفا",
    "اهر",
    "مراغه",
    "میانه",
    "سراب",
    "شبستر",
    "هشترود",
  ],
  آذربایجان_غربی: [
    "ارومیه",
    "خوی",
    "مهاباد",
    "سلماس",
    "نقده",
    "پیرانشهر",
    "سردشت",
    "بوکان",
  ],
  اردبیل: ["اردبیل", "خلخال", "مشگین‌شهر", "سرعین", "نمین", "نیر", "پارس‌آباد"],
  اصفهان: [
    "اصفهان",
    "کاشان",
    "خمینی‌شهر",
    "نجف‌آباد",
    "فلاورجان",
    "شاهین‌شهر",
    "شهرضا",
  ],
  البرز: ["کرج", "نظرآباد", "ساوجبلاغ", "اشتهارد", "طالقان"],
  ایلام: ["ایلام", "دهلران", "مهران", "آبدانان", "سرابله"],
  بوشهر: ["بوشهر", "گناوه", "دشتستان", "دیر", "کنگان", "جم"],
  تهران: ["تهران", "شهریار", "ورامین", "دماوند", "ری", "پردیس"],
  چهارمحال_و_بختیاری: ["شهرکرد", "بروجن", "فارسان", "لردگان"],
  خراسان_جنوبی: ["بیرجند", "قاین", "فردوس", "نهبندان"],
  خراسان_رضوی: ["مشهد", "گناباد", "تربت‌جام", "سبزوار", "نیشابور"],
  خراسان_شمالی: ["بجنورد", "اسفراین", "شیروان", "گرمه", "جاجرم"],
  خوزستان: ["اهواز", "آبادان", "خرمشهر", "ماهشهر", "دزفول", "بهبهان"],
  زنجان: ["زنجان", "ابهر", "خرمدره", "ماه‌نشان"],
  سمنان: ["سمنان", "شاهرود", "گرمسار", "دامغان"],
  سیستان_و_بلوچستان: ["زاهدان", "چابهار", "زابل", "ایرانشهر"],
  فارس: ["شیراز", "لار", "مرودشت", "فسا", "کازرون", "داراب"],
  قزوین: ["قزوین", "آبیک", "بوئین‌زهرا"],
  قم: ["قم"],
  کردستان: ["سنندج", "بیجار", "سقز", "بانه", "دیواندره"],
  کرمان: ["کرمان", "رفسنجان", "سیرجان", "بم"],
  کرمانشاه: ["کرمانشاه", "اسلام‌آبادغرب", "سنقر"],
  کهگیلویه_و_بویراحمد: ["یاسوج", "دوگنبدان"],
  گلستان: ["گرگان", "گنبدکاووس", "بندرترکمن"],
  گیلان: ["رشت", "انزلی", "لنگرود", "لاهیجان"],
  لرستان: ["خرم‌آباد", "بروجرد", "الیگودرز"],
  مازندران: ["ساری", "بابل", "آمل", "نوشهر"],
  مرکزی: ["اراک", "خمین", "ساوه"],
  هرمزگان: ["بندرعباس", "قشم", "کیش", "میناب"],
  همدان: ["همدان", "ملایر", "نهاوند"],
  یزد: ["یزد", "میبد", "اردکان"],
};

const provinces = Object.keys(cities);

let newOption;
provinces.forEach(function (provice) {
  newOption = document.createElement("option");
  newOption.className = "px-4";
  newOption.value = provice;
  newOption.innerHTML = provice;

  provincesSelect.append(newOption);
});

provincesSelect.addEventListener("change", function () {
  const provice = provincesSelect.value;

  let proviceCities = cities[provice];

  citiesSelect.innerHTML = "";
  let newCityOption;
  proviceCities.forEach(function (city) {
    newCityOption = document.createElement("option");
    newCityOption.className = "px-4";
    newCityOption.value = city;
    newCityOption.innerHTML = city;

    citiesSelect.append(newCityOption);
  });
});
